app/controllers/productions_controller.rb

  def index
    @productions = Production.all
---
SELECT "productions".* FROM "productions"

  def create
    @production = Production.new(production_params)

    respond_to do |format|
      if @production.save
---
INSERT INTO "productions" ("name", "price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["price", 111.0], ["amount", 1], ["created_at", "2019-11-02 12:07:14.308548"], ["updated_at", "2019-11-02 12:07:14.308548"]]

  def destroy
    @production.destroy
---
DELETE FROM "productions" WHERE "productions"."id" = ?  [["id", 1]]

    def set_production
      @production = Production.find(params[:id])
---
SELECT  "productions".* FROM "productions" WHERE "productions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]